Computing/1.2_Memory_and_Storage.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-05-16 Mon 11:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>1.2 Memory And Storage</title>
<meta name="author" content="Manas Mengle" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">1.2 Memory And Storage</h1>

<div id="outline-container-org64722fd" class="outline-2">
<h2 id="org64722fd"><span class="section-number-2">1.</span> 1.2 - Memory and Storage</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org01f5787" class="outline-3">
<h3 id="org01f5787"><span class="section-number-3">1.1.</span> 1.2.1 - Primary Storage (Memory)</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Refers to the <i>memory</i> areas that a <i>CPU</i> can access very quickly.
It has the <b>fastest</b> <i>read/write</i> speed and is mostly <b>volatile</b>
</p>
</div>
</div>
<div id="outline-container-org97265e8" class="outline-3">
<h3 id="org97265e8"><span class="section-number-3">1.2.</span> 1.2.2 - Secondary Storage</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<b>Non-volatile</b>. Where all data (operating systems, applications, user files) are stored when not in use.
Includes:
</p>
<ul class="org-ul">
<li>Magnetic hard disk drives</li>
<li>Solid state drives</li>
<li>CDs and SD cards</li>
</ul>
<p>
Much <b>slower</b> <i>read/write</i> speeds compared to <a href="#org01f5787">Primary Storage.</a>
</p>
</div>
</div>
<div id="outline-container-orgc2a6547" class="outline-3">
<h3 id="orgc2a6547"><span class="section-number-3">1.3.</span> 1.2.3 - Units</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Computers use 1s and 0s to represent the flow of electricity, with a <b>1</b> is used to show that electricity is flowing, and a <b>0</b> shows that it is <b>not</b> flowing.
    This is called <b>binary</b> code.
    Each 1 or 0 in a binary code is called a <b>bit</b> (binary digit). For example, <code>1010</code> is 4 bits.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Size</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Bit(b)</td>
<td class="org-left">A single binary digit (1 or 0)</td>
</tr>

<tr>
<td class="org-left">Nibble</td>
<td class="org-left">4 bits</td>
</tr>

<tr>
<td class="org-left">Byte (B)</td>
<td class="org-left">8 bits</td>
</tr>

<tr>
<td class="org-left">Kilobyte (kB)</td>
<td class="org-left">1000 bytes</td>
</tr>

<tr>
<td class="org-left">Megabyte (MB)</td>
<td class="org-left">1000 kilobytes</td>
</tr>

<tr>
<td class="org-left">Gigabyte (GB)</td>
<td class="org-left">1000 megabytes</td>
</tr>

<tr>
<td class="org-left">Terabyte (TB)</td>
<td class="org-left">1000 gigabytes</td>
</tr>

<tr>
<td class="org-left">Petabyte (PB)</td>
<td class="org-left">1000 terabytes</td>
</tr>
</tbody>
</table>
<p>
<i>Using powers of 2 (i.e: 1024 bytes in kB, etc.) would also be acceptable</i>
</p>
</div>
</div>
<div id="outline-container-orgb33615e" class="outline-3">
<h3 id="orgb33615e"><span class="section-number-3">1.4.</span> 1.2.4 - Data Storage</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-orgb32f4ac" class="outline-4">
<h4 id="orgb32f4ac"><span class="section-number-4">1.4.1.</span> Numbers</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
You can convert binary numbers to denary using tables.
For example, to convert the 8-bit number <code>0011 0101</code> to a denary number:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">128</th>
<th scope="col" class="org-right">64</th>
<th scope="col" class="org-right">32</th>
<th scope="col" class="org-right">16</th>
<th scope="col" class="org-right">8</th>
<th scope="col" class="org-right">4</th>
<th scope="col" class="org-right">2</th>
<th scope="col" class="org-right">1</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>
<p>
And add up all the numbers.
32+16+4+1=53. So <code>0011 0101</code> is 53 in denary.
</p>
</div>
</div>
<div id="outline-container-org1c91d91" class="outline-4">
<h4 id="org1c91d91"><span class="section-number-4">1.4.2.</span> Characters</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
Binary can be used to represent characters.
However, <b>alphanumeric</b> characters must be converted into binary before they can be read by a computer.
This is done using <b>character sets</b>
    <b>Character Sets</b> are collections of characters that a computer recognises from their <i>binary representation</i>.
They also contain <i>special characters</i> which do certain commands.
When you press a button on your keyboard, it sends a binary signal to the computer telling it which key was pressed. This code is then referenced with a character set to translate the binary code into a certain character.
There are <b>2</b> main character sets.
</p>
<ul class="org-ul">
<li><b>ASCII</b>, or <b>A</b>merican <b>S</b>tandard <b>I</b>nterchange <b>F</b>ormat, which uses <i>7 bits</i> to give each character
<ul class="org-ul">
<li>This means it can represent a total of <b>128</b> different characters, including all the English alphabet, numbers, symbols and commands.</li>
<li>An extra 0 is added to the beginning of each ASCII character to make it fit into <i>1 byte</i>, or 2 hexadecimal characters.</li>
</ul></li>
<li><b>Unicode</b>, which aims to cover every possible character or symbol, and uses <i>16 bits</i> to give each character
<ul class="org-ul">
<li>It aims to cover all major languages, even ones with a completely different language.</li>
<li>Its first <b>128</b> codes are the same as ASCII.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orga083cc9" class="outline-4">
<h4 id="orga083cc9"><span class="section-number-4">1.4.3.</span> Sound</h4>
</div>
</div>
<div id="outline-container-orgc7a4cd9" class="outline-3">
<h3 id="orgc7a4cd9"><span class="section-number-3">1.5.</span> 1.2.5 - Compression</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-org11e8059" class="outline-4">
<h4 id="org11e8059"><span class="section-number-4">1.5.1.</span> Need</h4>
</div>
<div id="outline-container-orgef0405f" class="outline-4">
<h4 id="orgef0405f"><span class="section-number-4">1.5.2.</span> Types</h4>
<div class="outline-text-4" id="text-1-5-2">
</div>
<ol class="org-ol">
<li><a id="org62faba6"></a>Lossy<br /></li>
<li><a id="orge696139"></a>Lossless<br /></li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Manas Mengle</p>
<p class="date">Created: 2022-05-16 Mon 11:50</p>
</div>
</body>
</html>
